app/controllers/api/v1/game_controller.rb

  def create
  	# byebug
  	game = Game.create(game_params)
---
INSERT INTO "games" ("username", "outcome", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "z"], ["outcome", "t"], ["created_at", "2017-08-24 14:56:03.440120"], ["updated_at", "2017-08-24 14:56:03.440120"]]